Config/Documents/НачислениеРезервовПоОтпускам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеРезервовПоОтпускам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОперацииКапвложений</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаОбязательств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортированИзЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Comment>Хранит идентификатор объекта источника при переносе данных из другой системы (например БГУ1)</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОценочныеОбязательства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияЗарплатыВУчете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансированияЗарплата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперацииПоЗарплате</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаетсяЕНВД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчете</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчетеЗаполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУчетеДоступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтразитьВКарточкеКапвложений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарточкаКапвложений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/НачислениеРезервовПоОтпускам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Формирует таблицу двдижений по регистру сведений "Операции капвложений"
// Вызывается после формирования таблицы проводок для документа при его проведении
//
// Параметры:
//  ТаблицаПроводок - Таблица значений. Таблица проводок, которые будут сформированы
//  ДокументОбъект - Документ объект. Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура. Структура дополнительных реквизитов типовой бухгалтерской операции
//  ТабДвижений - Таблица значений. Исходящая таблица. Ее заполняет эта функция
//  ТекстОшибки - Строка. Исходящая строка, описание ошики. Ее заполняет эта функция, если была ошибка.
//
// Возвращает флаг ошибки. Если Истина - все ОК, иначе - Ложь
Функция ИнициализироватьТабДвиженийДляКарточкиКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Экспорт

	ТекОрганизация = ДокументОбъект.Организация;
	ТекДата        = ДокументОбъект.Дата;
	МассивККВ      = Новый Массив;
	Для каждого СтрокаТЧ из ДокументОбъект.ОценочныеОбязательства Цикл
		Если НЕ СтрокаТЧ.ОтразитьВКарточкеКапвложений ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.КарточкаКапвложений) Тогда
			Продолжить;
		ИначеЕсли МассивККВ.Найти(СтрокаТЧ.КарточкаКапвложений) <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;	
		
		НоваяСтрока = ТабДвижений.Добавить();
		НоваяСтрока.Организация         = ТекОрганизация;
		НоваяСтрока.КарточкаКапвложений = СтрокаТЧ.КарточкаКапвложений;
		НоваяСтрока.Период              = ТекДата;
		
		МассивККВ.Добавить(СтрокаТЧ.КарточкаКапвложений);
	КонецЦикла;	

	Возврат Истина;
КонецФункции	

#КонецОбласти

#КонецЕсли
